src/Catalogs/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСделки</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаУспех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницыПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыПациентовПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусПациента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыСделок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоРедактировать 			= ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные());
	ЗаблокироватьИзменениеЭтапов 	= Объект.Предопределенный И Объект.Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	
	// Определяем режим отображения структурных единиц применения
	ОпределитьРежимОтображенияСпискаСтруктурныхЕдиниц();
	
	//// Определяем режим отображения статусов пациента применения
	//ОпределитьРежимОтображенияСпискаСтатусовПациентов();
	
	// Устанавливаем видимость элементам в зависимости от режима отображения
	УстановитьВидимостьЭлементамСпискаСтруктурныхЕдиниц();
	
	//// Устанавливаем видимость элементам в зависимости от режима отображения
	//УстановитьВидимостьЭлементамСпискаСтатусовПациентов();
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТЗЭтапов = Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(Объект.Ссылка);
		
		Для Каждого СтрокаТЗ Из ТЗЭтапов Цикл
			
			НоваяСтрока = ЭтотОбъект.ЭтапыСделок.Добавить();	
			НоваяСтрока.Цвет         =  СтрокаТЗ.ЭтапСделки.ЦветЭтапа;
			НоваяСтрока.Наименование =  СтрокаТЗ.ЭтапСделки.Наименование;
			НоваяСтрока.Ссылка		 =  СтрокаТЗ.ЭтапСделки;
			
		КонецЦикла;
		//// Реквизит "ТипСделки" был добавлен в справочник позже. Он обязателен к заполнению. Для предопределенного элемента справочника
		//// заполним его при открытии, несмотря на то что так делать крайне неправильно.
		//Если Объект.Предопределенный И Объект.ИмяПредопределенныхДанных = "ПродажаЧленства" Тогда
		//	Если НЕ ЗначениеЗаполнено(Объект.ТипСделки) ИЛИ Объект.ТипСделки = Перечисления.ТипыСделок.Продление Тогда 
		//		Объект.ТипСделки = Перечисления.ТипыСделок.Продажа;
		//	КонецЕсли;	
		//КонецЕсли;	
	КонецЕсли;
	
	НоваяСтрока = ЭтапыСделок.Добавить();
	УправлениеИнтерфейсамиСервер.ОбновитьПалитруЦветов(ЭтаФорма);	
	СоздатьЭлементыТаблицы();
	
	ОтобразитьДопустимыеПричиныОтказа(Истина);
	
	ЗаблокироватьЭлементыДляПредопреленныхОбъектов();
	
	ИнициализироватьСписокСтруктурныхЕдиниц();
	
	//ИнициализироватьСписокСтатусовПациентов();
	
	Для Каждого СтрокаСЕПрименения Из Объект.СтруктурныеЕдиницыПрименения Цикл 
		СтрокаСЕПрименения.ПоУмолчанию = ЗначениеЗаполнено(СтрокаСЕПрименения.СтруктурнаяЕдиница) И СтрокаСЕПрименения.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
	КонецЦикла;	
	
	ЗаблокироватьЭлементыПоПравамДоступаОбъекта();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКнопкаСохранитьИЗакрыть;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтапыСделок", ЭтапыСделок.Выгрузить());
	
	ТаблицаПримененияСЕ = ТекущийОбъект.СтруктурныеЕдиницыПрименения.Выгрузить(, "СтруктурнаяЕдиница");
	ТаблицаПримененияСЕ.Свернуть("СтруктурнаяЕдиница");
	Если ТаблицаПримененияСЕ.Количество() > 1 Тогда 
		ПустаяСтрокаСЕ = ТаблицаПримененияСЕ.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), "СтруктурнаяЕдиница");
		Если ПустаяСтрокаСЕ <> Неопределено Тогда 
			ТаблицаПримененияСЕ.Удалить(ПустаяСтрокаСЕ);
		КонецЕсли;	
	КонецЕсли;
	ТекущийОбъект.СтруктурныеЕдиницыПрименения.Загрузить(ТаблицаПримененияСЕ);
	
	//ТаблицаПримененияСтатусов = ТекущийОбъект.СтатусыПациентовПрименения.Выгрузить(, "СтатусПациента");
	//ТаблицаПримененияСтатусов.Свернуть("СтатусПациента");
	//Если ТаблицаПримененияСтатусов.Количество() > 1 Тогда 
	//	ПустаяСтрокаСтатуса = ТаблицаПримененияСтатусов.Найти(Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), "СтатусПациента");
	//	Если ПустаяСтрокаСтатуса <> Неопределено Тогда 
	//		ТаблицаПримененияСтатусов.Удалить(ПустаяСтрокаСтатуса);
	//	КонецЕсли;	
	//КонецЕсли;
	//ТекущийОбъект.СтатусыПациентовПрименения.Загрузить(ТаблицаПримененияСтатусов);
	
	Если ТекущийОбъект.ПричиныОтказов.Количество() > 0 Тогда
		Если НЕ ТекущийОбъект.ПричиныОтказов.Найти(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина")) = Неопределено Тогда 
			ТекущийОбъект.ПричиныОтказов.Очистить();
		Иначе 
			ТаблицаПричинОтказов = СгруппироватьПричиныОтказа(ТекущийОбъект);	
			//Если НЕ ЗначениеЗаполнено(ТаблицаПричинОтказов) Тогда
			//	Отказ = Истина;
			//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Укажите причину отказа';en='Specify the reason for refusal'")
			//	, 
			//	, "Объект.ПричиныОтказов[0].ПричинаОтказа");
			//	Возврат;
			//КонецЕсли;		
			ТекущийОбъект.ПричиныОтказов.Загрузить(ТаблицаПричинОтказов);
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - Сгруппировать причины отказа
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СгруппироватьПричиныОтказа(ТекущийОбъект)

	ТаблицаПричинОтказов = ТекущийОбъект.ПричиныОтказов.Выгрузить(, "ПричинаОтказа");
	ТаблицаПричинОтказов.Свернуть("ПричинаОтказа");
	ПустаяСтрокаПричины = ТаблицаПричинОтказов.Найти(Справочники.ПричиныОтказов.ПустаяСсылка(), "ПричинаОтказа");
	Если ПустаяСтрокаПричины <> Неопределено Тогда 
		ТаблицаПричинОтказов.Удалить(ПустаяСтрокаПричины);
	КонецЕсли;	

	Возврат ТаблицаПричинОтказов;
	
КонецФункции

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОБНОВИТЬ_ВИДЫ_И_ЭТАПЫ_СДЕЛОК", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Структурная единица обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивОтбираемыхСЕ = Новый Массив;
	Для Каждого ЭлементСписка Из СписокДоступныхСтруктурныхЕдиниц Цикл
		Если Объект.СтруктурныеЕдиницыПрименения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ЭлементСписка.Значение)).Количество() = 0 
			И НЕ ЭлементСписка.Значение = ВыбранноеЗначение Тогда 
			МассивОтбираемыхСЕ.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
	КонецЦикла;
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСЕ)));
	
	Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация подсказка добавить нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияПодсказкаДобавитьНажатие(Элемент)
	
	УстановитьВидимостьЭлементамСпискаСтруктурныхЕдиниц(Истина);
	Элементы.СтруктурныеЕдиницыПрименения.ДобавитьСтроку();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Структурные единицы применения при активизации поля
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура СтруктурныеЕдиницыПримененияПриАктивизацииПоля(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "СтруктурныеЕдиницыПримененияУдаление" Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			МассивОтбираемыхСЕ = Новый Массив;			
			Объект.СтруктурныеЕдиницыПрименения.Удалить(Элемент.ТекущиеДанные);
			Для Каждого ЭлементСписка Из СписокДоступныхСтруктурныхЕдиниц Цикл
				Если Объект.СтруктурныеЕдиницыПрименения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ЭлементСписка.Значение)).Количество() = 0 Тогда 
					МассивОтбираемыхСЕ.Добавить(ЭлементСписка.Значение);
				КонецЕсли;	
			КонецЦикла;
			Массив = Новый Массив;
			Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСЕ)));
			
			Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Структурные единицы применения структурная единица обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СтруктурныеЕдиницыПримененияСтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивОтбираемыхСЕ = Новый Массив;
	Для Каждого ЭлементСписка Из СписокДоступныхСтруктурныхЕдиниц Цикл
		Если Объект.СтруктурныеЕдиницыПрименения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ЭлементСписка.Значение)).Количество() = 0 
			И НЕ ЭлементСписка.Значение = ВыбранноеЗначение Тогда 
			МассивОтбираемыхСЕ.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
	КонецЦикла;
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСЕ)));
	
	Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статус пациента обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СтатусПациентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивОтбираемыхСтатусов = Новый Массив;
	Для Каждого ЭлементСписка Из СписокДоступныхСтатусовПациентов Цикл
		Если Объект.СтатусыПациентовПрименения.НайтиСтроки(Новый Структура("СтатусПациента", ЭлементСписка.Значение)).Количество() = 0 
			И НЕ ЭлементСписка.Значение = ВыбранноеЗначение Тогда 
			МассивОтбираемыхСтатусов.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
	КонецЦикла;
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСтатусов)));
	
	Элементы.СтатусыПациентовПримененияСтатусПациента.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Декорация подсказка добавить нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияПодсказкаСтатусДобавитьНажатие(Элемент)
	
	УстановитьВидимостьЭлементамСпискаСтатусовПациентов(Истина);
	Элементы.СтатусыПациентовПрименения.ДобавитьСтроку();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статусы пациентов применения при активизации поля
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура СтатусыПациентовПримененияПриАктивизацииПоля(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "СтатусыПациентовПримененияУдаление" Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			МассивОтбираемыхСтатусов = Новый Массив;			
			Объект.СтатусыПациентовПрименения.Удалить(Элемент.ТекущиеДанные);
			Для Каждого ЭлементСписка Из СписокДоступныхСтатусовПациентов Цикл
				Если Объект.СтатусыПациентовПрименения.НайтиСтроки(Новый Структура("СтатусПациента", ЭлементСписка.Значение)).Количество() = 0 Тогда 
					МассивОтбираемыхСтатусов.Добавить(ЭлементСписка.Значение);
				КонецЕсли;	
			КонецЦикла;
			Массив = Новый Массив;
			Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСтатусов)));
			
			Элементы.СтатусыПациентовПримененияСтатусПациента.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.СтатусыПациентовПримененияСтатусПациента;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Статусы пациентов применения статус пациента обработка выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура СтатусыПациентовПримененияСтатусПациентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивОтбираемыхСтатусов = Новый Массив;
	Для Каждого ЭлементСписка Из СписокДоступныхСтатусовПациентов Цикл
		Если Объект.СтатусыПациентовПрименения.НайтиСтроки(Новый Структура("СтатусПациента", ЭлементСписка.Значение)).Количество() = 0 
			И НЕ ЭлементСписка.Значение = ВыбранноеЗначение Тогда 
			МассивОтбираемыхСтатусов.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
	КонецЦикла;
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСтатусов)));
	
	Элементы.СтатусыПациентовПримененияСтатусПациента.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ДобавитьНовыйЭтап".
//
Процедура ДобавитьНовыйЭтап(Элемент)
	
	Индекс = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	ЭтоПоследняяСтрока = ?((ЭтотОбъект.ЭтапыСделок.Количество() - 1) = Индекс, Истина, Ложь);
	
	Если ЭтоПоследняяСтрока Тогда
		ДобавитьНовыйЭтапНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить выбор новой причны
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДобавитьВыборНовойПричны(Элемент)
	
	Индекс = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	ЭтоПоследняяСтрока = ?((Объект.ПричиныОтказов.Количество() - 1) = Индекс, Истина, Ложь);
	
	ГруппаРазмещенияПричинОтказа = Элементы.Найти("ГруппаЭтапаИПричинОтказов");
	Если НЕ ГруппаРазмещенияПричинОтказа = Неопределено Тогда 
		Если ЭтоПоследняяСтрока Тогда
			ИндексСтроки = ДобавитьНовуюПричинуОтказа();	
		КонецЕсли;
		
        ОтобразитьДопустимыеПричиныОтказа();
		Если ЭтоПоследняяСтрока Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы["ПричинаОтказа_" + Формат(ИндексСтроки, "ЧДЦ=0; ЧН=0; ЧГ=0")];
		КонецЕсли;	
    КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Переключатель поле список
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключательПолеСписок(Команда)
	
	Если РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" Тогда 
		РежимОтображенияСпискаСтруктурныхЕдиниц = "Список";
		МассивПустыхСтрок = Объект.СтруктурныеЕдиницыПрименения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка")));
		Для Каждого ПустаяСтрока Из МассивПустыхСтрок Цикл 
			Объект.СтруктурныеЕдиницыПрименения.Удалить(Объект.СтруктурныеЕдиницыПрименения.Индекс(ПустаяСтрока));
		КонецЦикла;	
	Иначе 
		Если Объект.СтруктурныеЕдиницыПрименения.Количество() = 0 Тогда
			НоваяСтрока = Объект.СтруктурныеЕдиницыПрименения.Добавить();
		ИначеЕсли Объект.СтруктурныеЕдиницыПрименения.Количество() > 1 Тогда
			ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ПредупреждениеКлиникиПримененияОчистятся", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияВопроса, "Внимание!" + Символы.ПС + "Указанный список клиник очистится." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Вопрос пользователю");
			Возврат;
		КонецЕсли;
		РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле";		
		Объект.СтруктурныеЕдиницыПрименения[0].СтруктурнаяЕдиница = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
	КонецЕсли;	
	
	УстановитьВидимостьЭлементамСпискаСтруктурныхЕдиниц();

КонецПроцедуры

&НаКлиенте
// Процедура - Предупреждение клиники применения очистятся
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПредупреждениеКлиникиПримененияОчистятся(Результат, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда 
		Если Результат = КодВозвратаДиалога.Да Тогда 
			РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле";
			Объект.СтруктурныеЕдиницыПрименения.Очистить();
			НоваяСтрока = Объект.СтруктурныеЕдиницыПрименения.Добавить();
			Объект.СтруктурныеЕдиницыПрименения[0].СтруктурнаяЕдиница = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
			УстановитьВидимостьЭлементамСпискаСтруктурныхЕдиниц();			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить по умолчанию
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьПоУмолчанию(Команда)
	
	ТекущиеДанные = Элементы.СтруктурныеЕдиницыПрименения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда 
			Объект.СтруктурнаяЕдиница = ТекущиеДанные.СтруктурнаяЕдиница;
			Для Каждого СтрокаСЕПрименения Из Объект.СтруктурныеЕдиницыПрименения Цикл 
				СтрокаСЕПрименения.ПоУмолчанию = ЗначениеЗаполнено(СтрокаСЕПрименения.СтруктурнаяЕдиница) И СтрокаСЕПрименения.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
			КонецЦикла;	
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВыбратьЦвет".
//
Процедура ВыбратьЦвет(Команда) Экспорт
	
	Если СтрНайти(Команда.Имя, "КомандаЦвет") > 0 Тогда
		
		ИмяКнопки  	 = ЭтаФорма.ТекущийЭлемент.Имя;
		ИзменитьЦветЭтапаНаСервере(ИмяКнопки, ЭтаФорма.ТекущийЭлемент.ЦветФона);
			
	Иначе
		
		ИмяКнопки  	 = ЭтаФорма.ТекущийЭлемент.Имя;
		ИндексКнопки = ПолучитьИндексСтроки(ИмяКнопки);
		
		Этап = ЭтаФорма.ЭтапыСделок[ИндексКнопки];
		ПереместитьПалитруЦветов(ИндексКнопки);
		
		Элементы.ВсплывающаяПалтира.Видимость = Истина;
		Элементы["ГруппаВсплывающая_" + ИндексКнопки].Показать();
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "УдалитьСтрокуТаблицы".
//
Процедура УдалитьСтрокуТаблицы(Команда)
	
	ИндексСтроки = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);	
	ОповещениеУдаленияЭтапа = Новый ОписаниеОповещения("УдалениеЭтапаПослеПодтверждения", ЭтотОбъект, Новый Структура("ИндексСтроки", ИндексСтроки));
	ТекстВопроса = НСтр("ru='Удалить этап вида сделки?';en='Delete a transaction type stage?'");
	ПоказатьВопрос(ОповещениеУдаленияЭтапа, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru='Вопрос пользователю';en='Question to the user'")); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удаление этапа после подтверждения
//
// Параметры:
//  РешениеПользователя		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УдалениеЭтапаПослеПодтверждения(РешениеПользователя, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РешениеПользователя <> Неопределено Тогда 
		Если РешениеПользователя = КодВозвратаДиалога.Да Тогда 
			УдалитьЭлементыТаблицы(ДополнительныеПараметры.ИндексСтроки);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удалить причину отказа
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УдалитьПричинуОтказа(Команда)
	
	ИндексСтроки = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);	
	ОповещениеУдаленияЭтапа = Новый ОписаниеОповещения("УдалениеПричиныОтказаПослеПодтверждения", ЭтотОбъект, Новый Структура("ИндексСтроки", ИндексСтроки));
	ТекстВопроса = НСтр("ru='Удалить причину отказа?';en='Remove Denial Reason?'");
	ПоказатьВопрос(ОповещениеУдаленияЭтапа, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru='Вопрос пользователю';en='Question to the user'")); 
	
КонецПроцедуры

&НаКлиенте
// Процедура - Удаление причины отказа после подтверждения
//
// Параметры:
//  РешениеПользователя		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УдалениеПричиныОтказаПослеПодтверждения(РешениеПользователя, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РешениеПользователя <> Неопределено Тогда 
		Если РешениеПользователя = КодВозвратаДиалога.Да Тогда 
			УдалитьПричинуОтказаНаСервере(ДополнительныеПараметры.ИндексСтроки);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПереместитьВверх".
//
Процедура ПереместитьВверх(Команда)
	
	ИндексСтроки = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	Если ИндексСтроки <> 0  Тогда
		
		ЭтотОбъект.ЭтапыСделок.Сдвинуть(ИндексСтроки, -1);
		ОбновитьДинамическиеЭлементы();

	КонецЕсли;
	
	ИндексПоследнейСтроки   = ЭтотОбъект.ЭтапыСделок.Количество() - 1;
	ЭтаФорма.ТекущийЭлемент = Элементы["Наименование_" + ИндексПоследнейСтроки];  
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПереместитьВниз".
//
Процедура ПереместитьВниз(Команда)
	
	ИндексСтроки  = ПолучитьИндексСтроки(ЭтаФорма.ТекущийЭлемент.Имя);
	КоличествоДляСмещения = ЭтотОбъект.ЭтапыСделок.Количество() - 1;
	
	Если ИндексСтроки + 1 < КоличествоДляСмещения Тогда
		ЭтотОбъект.ЭтапыСделок.Сдвинуть(ИндексСтроки, 1);
		ОбновитьДинамическиеЭлементы();
	КонецЕсли;
	
	ЭтаФорма.ТекущийЭлемент = Элементы["Наименование_" + КоличествоДляСмещения];  
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переключатель поле список статусов
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключательПолеСписокСтатусов(Команда)

	Если НЕ ЕстьПравоРедактировать ИЛИ Объект.Предопределенный Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимОтображенияСпискаСтатусовПациента = "Поле" Тогда 
		РежимОтображенияСпискаСтатусовПациента = "Список";
		МассивПустыхСтрок = Объект.СтатусыПациентовПрименения.НайтиСтроки(Новый Структура("СтатусПациента", ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.ПустаяСсылка")));
		Для Каждого ПустаяСтрока Из МассивПустыхСтрок Цикл 
			Объект.СтатусыПациентовПрименения.Удалить(Объект.СтатусыПациентовПрименения.Индекс(ПустаяСтрока));
		КонецЦикла;	
	Иначе 
		Если Объект.СтатусыПациентовПрименения.Количество() = 0 Тогда
			НоваяСтрока = Объект.СтатусыПациентовПрименения.Добавить();
		ИначеЕсли Объект.СтатусыПациентовПрименения.Количество() > 1 Тогда
			ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ПредупреждениеСтатусыПациентовПримененияОчистятся", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияВопроса, "Внимание!" + Символы.ПС + "Указанный список статусов пациентов очистится." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Вопрос пользователю");
			Возврат;
		КонецЕсли;
		РежимОтображенияСпискаСтатусовПациента = "Поле";		
		Объект.СтатусыПациентовПрименения[0].СтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.ПустаяСсылка");
	КонецЕсли;	
	
	УстановитьВидимостьЭлементамСпискаСтатусовПациентов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Предупреждение статусы пациентов применения очистятся
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПредупреждениеСтатусыПациентовПримененияОчистятся(Результат, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда 
		Если Результат = КодВозвратаДиалога.Да Тогда 
			РежимОтображенияСпискаСтатусовПациента = "Поле";
			Объект.СтатусыПациентовПрименения.Очистить();
			НоваяСтрока = Объект.СтатусыПациентовПрименения.Добавить();
			Объект.СтатусыПациентовПрименения[0].СтатусПациента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.ПустаяСсылка");
			УстановитьВидимостьЭлементамСпискаСтатусовПациентов();			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить по умолчанию статус пациента
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьПоУмолчаниюСтатусПациента(Команда)
	
	//ТекущиеДанные = Элементы.СтатусыПациентовПрименения.ТекущиеДанные;
	//Если ТекущиеДанные <> Неопределено Тогда
	//	Если ЗначениеЗаполнено(ТекущиеДанные.СтатусПациента) Тогда 
	//		Объект.СтатусПациента = ТекущиеДанные.СтруктурнаяЕдиница;
	//		Для Каждого СтрокаСтатусПрименения Из Объект.СтатусыПациентовПрименения Цикл 
	//			СтрокаСтатусПрименения.ПоУмолчанию = ЗначениеЗаполнено(СтрокаСтатусПрименения.СтатусПациента) И СтрокаСтатусПрименения.СтатусПациента = Объект.СтатусПациента;
	//		КонецЦикла;	
	//		ЭтаФорма.Модифицированность = Истина;
	//	КонецЕсли;
	//КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ПалитраЦветов

&НаСервере
// Процедура, ПереместитьПалитруКРодителю.
//
Процедура ПереместитьПалитруКРодителю()
	
	Элементы.Переместить(Элементы.ВсплывающаяПалтира, Элементы.ПалитраЦветовРодитель);
	Элементы.ВсплывающаяПалтира.Видимость = Ложь;

КонецПроцедуры

&НаСервере
// Процедура, ПереместитьПалитруЦветов.
//
Процедура ПереместитьПалитруЦветов(ИндексКнопки)
	
  	Элементы.Переместить(Элементы.ВсплывающаяПалтира, Элементы["ГруппаВсплывающая_" + ИндексКнопки], Элементы["Наименование_" + ИндексКнопки]);  
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Отобразить допустимые причины отказа
//
// Параметры:
//  СозданиеФормы	 - 	 - 
//  УдалитьЭлементы	 - 	 - 
//
Процедура ОтобразитьДопустимыеПричиныОтказа(СозданиеФормы = Ложь, УдалитьЭлементы = Истина)
	
	ЛюбаяПричина = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.ЛюбаяПричина");
	Если СозданиеФормы И НЕ ЗаблокироватьИзменениеЭтапов Тогда
		НоваяСтрока = Объект.ПричиныОтказов.Добавить();
		Если Объект.ПричиныОтказов.Количество() = 1 Тогда
			НоваяСтрока.ПричинаОтказа = ЛюбаяПричина;
			НоваяСтрока = Объект.ПричиныОтказов.Добавить();			
		КонецЕсли;	
	КонецЕсли;
	
	Если УдалитьЭлементы Тогда 
		ГруппаРазмещенияПричинОтказа = Элементы.Найти("ГруппаЭтапаИПричинОтказов");
		Если НЕ ГруппаРазмещенияПричинОтказа = Неопределено Тогда 
			УдалитьЭлементыГруппы(ГруппаРазмещенияПричинОтказа);
		КонецЕсли;
	КонецЕсли;
	
	УказанаЛюбаяПричина = НЕ Объект.ПричиныОтказов.НайтиСтроки(Новый Структура("ПричинаОтказа", ЛюбаяПричина)).Количество() = 0;
	МассивНеЗадействованныхПричинОтказа = ПолучитьМассивНеЗадействованныхПричинОтказа(Объект.ПричиныОтказов.Выгрузить().ВыгрузитьКолонку("ПричинаОтказа"));
	
	Для Каждого СтрокаТЧ Из Объект.ПричиныОтказов Цикл
		ИндексСтроки = Объект.ПричиныОтказов.Индекс(СтрокаТЧ);
		СоздатьСтрокуОтказаИВыбораПричины(ИндексСтроки, МассивНеЗадействованныхПричинОтказа, УказанаЛюбаяПричина, ЛюбаяПричина);		
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Функция - Получить массив не задействованных причин отказа
//
// Параметры:
//  МассивУказанныхПричин	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивНеЗадействованныхПричинОтказа(МассивУказанныхПричин)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивУказанныхПричин", МассивУказанныхПричин);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныОтказов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтказов КАК ПричиныОтказов
	|ГДЕ
	|	НЕ ПричиныОтказов.Ссылка В (&МассивУказанныхПричин)
	|	И ПричиныОтказов.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
// Процедура - Создать строку отказа и выбора причины
//
// Параметры:
//  ИндексСтроки - 	 - 
//
Процедура СоздатьСтрокуОтказаИВыбораПричины(ИндексСтроки, МассивНеЗадействованныхПричинОтказа, УказанаЛюбаяПричина, ЛюбаяПричина)
	
	ИндекстСтрокой 									= Формат(ИндексСтроки, "ЧДЦ=0; ЧН=0; ЧГ=0");
	
	ГруппаНовыхЭл                       			= Элементы.Добавить("СтрокаТаблицыОтказов_" + ИндекстСтрокой, Тип("ГруппаФормы"), Элементы.ГруппаЭтапаИПричинОтказов);
	ГруппаНовыхЭл.Вид                  	 			= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНовыхЭл.Группировка           			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаНовыхЭл.Отображение           			= ОтображениеОбычнойГруппы.Нет;
	ГруппаНовыхЭл.ОтображатьЗаголовок   			= Ложь;
	ГруппаНовыхЭл.ГоризонтальныйИнтервал			= ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаНовыхЭл.ВертикальноеПоложениеПодчиненных 	= ВертикальноеПоложениеЭлемента.Центр;
	Если ЗаблокироватьИзменениеЭтапов Тогда 
		ГруппаНовыхЭл.ТолькоПросмотр 				= Истина;
	Иначе 	
		ГруппаНовыхЭл.Доступность 					= ?(УказанаЛюбаяПричина, ?(Объект.ПричиныОтказов[ИндексСтроки].ПричинаОтказа = ЛюбаяПричина ИЛИ Объект.ПричиныОтказов[ИндексСтроки].ПричинаОтказа = Справочники.ПричиныОтказов.ПустаяСсылка(), Истина, Ложь), Истина);
	КонецЕсли;	
	
	// Создаем заглушку
	ДекорацияФормы_Заглушка = Элементы.Добавить("ЗаглушкаОтказов_" + ИндекстСтрокой, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
	ДекорацияФормы_Заглушка.Вид 				   	= ВидДекорацииФормы.Надпись;
	ДекорацияФормы_Заглушка.Заголовок 			   	= 0;
	ДекорацияФормы_Заглушка.ЦветТекста 				= Новый Цвет(255, 255, 255);
	ДекорацияФормы_Заглушка.Ширина                	= 2;	
	ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина 	= Ложь;
	ДекорацияФормы_Заглушка.МаксимальнаяШирина     	= 2;
	ДекорацияФормы_Заглушка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ДекорацияФормы_Заглушка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
	// Создаем поле выбора причины отказа.
	ПричинаОтказа                    				= Элементы.Добавить("ПричинаОтказа_" + ИндекстСтрокой, Тип("ПолеФормы"), ГруппаНовыхЭл);
	ПричинаОтказа.Вид                				= ВидПоляФормы.ПолеВвода;
	ПричинаОтказа.ПоложениеЗаголовка 				= ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПричинаОтказа.Заголовок 						= НСтр("ru='Отказ';en='Refusal'");
	ПричинаОтказа.ЦветТекстаЗаголовка 				= Новый Цвет(255, 0, 0);
	ПричинаОтказа.ПодсказкаВвода     				= НСтр("ru='Укажите причину отказа';en='Specify the reason for refusal'");		
	ПричинаОтказа.ПутьКДанным        				= "Объект.ПричиныОтказов[" + ИндекстСтрокой + "].ПричинаОтказа";
	ПричинаОтказа.АвтоМаксимальнаяШирина 			= Ложь;
	ПричинаОтказа.МаксимальнаяШирина     			= 42;
	ПричинаОтказа.Шрифт 							= ?(УказанаЛюбаяПричина, ?(Объект.ПричиныОтказов[ИндексСтроки].ПричинаОтказа = ЛюбаяПричина ИЛИ Объект.ПричиныОтказов[ИндексСтроки].ПричинаОтказа = Справочники.ПричиныОтказов.ПустаяСсылка(), Новый Шрифт, Новый Шрифт(,,,,, Истина)), Новый Шрифт);
	ПричинаОтказа.УстановитьДействие("ПриИзменении", "ДобавитьВыборНовойПричны");
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивНеЗадействованныхПричинОтказа));
	ПричинаОтказа.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	Если ЗначениеЗаполнено(Объект.ПричиныОтказов[ИндексСтроки].ПричинаОтказа) Тогда
		// Создаем кнопку удаления.
		КнопкаУдаления                  			= Элементы.Добавить("УдалитьПричинуОтказа_" + ИндекстСтрокой, Тип("КнопкаФормы"), ГруппаНовыхЭл);
		КнопкаУдаления.Отображение     	    		= ОтображениеКнопки.Картинка;
		КнопкаУдаления.ОтображениеФигуры 			= ОтображениеФигурыКнопки.Нет;
		КнопкаУдаления.ИмяКоманды      	    		= "УдалитьПричинуОтказа";    	
		КнопкаУдаления.Доступность 					= НЕ ЗаблокироватьИзменениеЭтапов;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Заблокировать элементы для предопреленных объектов
//
Процедура ЗаблокироватьЭлементыДляПредопреленныхОбъектов()
	
	Элементы.ТипСделки.ТолькоПросмотр = Объект.Предопределенный;
	
	Элементы.СтраницыДоступностиПоСтатусамПациентов.ТолькоПросмотр 	= Объект.Предопределенный;
	Элементы.СтатусыПациентовПрименения.ТолькоПросмотр 				= Объект.Предопределенный;
	Элементы.СтатусыПациентовПримененияУдаление.Видимость 			= НЕ Объект.Предопределенный;
	Элементы.СтатусыПациентовПримененияУдаление.Доступность			= НЕ Объект.Предопределенный;	
	Элементы.КнопкаДобавитьСтатус.Видимость 						= НЕ Объект.Предопределенный;
	Элементы.УстановитьПоУмолчаниюСтатусы.Доступность				= НЕ Объект.Предопределенный;
	Элементы.ПереключательПолеСтатус.Доступность 					= НЕ Объект.Предопределенный;
	Элементы.ПереключательСписокСтатусов.Доступность 				= НЕ Объект.Предопределенный;
	
	Если ЗаблокироватьИзменениеЭтапов Тогда 
		Элементы.ГруппаЭтапы.ТолькоПросмотр 						= Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заблокировать элементы по правам доступа объекта
//
Процедура ЗаблокироватьЭлементыПоПравамДоступаОбъекта()
	
	Если НЕ ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные()) Тогда
    	Элементы.ПереключательСписок.Доступность 						= Ложь;
		Элементы.ПереключательПоле.Доступность 							= Ложь;
		Элементы.СтруктурныеЕдиницыПрименения.ТолькоПросмотр 			= Истина;
		Элементы.УстановитьПоУмолчанию.Доступность 						= Ложь;
		Элементы.СтруктурныеЕдиницыПримененияУдаление.Доступность 		= Ложь;
		
		Элементы.ПереключательСписокСтатусов.Доступность 				= Ложь;
		Элементы.ПереключательПолеСтатус.Доступность 					= Ложь;
		Элементы.СтатусыПациентовПрименения.ТолькоПросмотр 				= Истина;
		Элементы.УстановитьПоУмолчаниюСтатусы.Доступность 				= Ложь;
		Элементы.СтатусыПациентовПримененияУдаление.Доступность 		= Ложь;
		
		Элементы.ГруппаЭтапы.Доступность 								= Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Определить режим отображения списка структурных единиц
//
Процедура ОпределитьРежимОтображенияСпискаСтруктурныхЕдиниц()
	
	// По умолчанию
	РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле";
	
	Если Объект.СтруктурныеЕдиницыПрименения.Количество() > 1 Тогда
		РежимОтображенияСпискаСтруктурныхЕдиниц = "Список";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Определить режим отображения списка статусов пациентов
//
Процедура ОпределитьРежимОтображенияСпискаСтатусовПациентов()
	
	// По умолчанию
	РежимОтображенияСпискаСтатусовПациента = "Поле";
	
	Если Объект.СтатусыПациентовПрименения.Количество() > 1 Тогда
		РежимОтображенияСпискаСтатусовПациента = "Список";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементам списка структурных единиц
//
// Параметры:
//  НачатьДобавление - 	 - 
//
Процедура УстановитьВидимостьЭлементамСпискаСтруктурныхЕдиниц(НачатьДобавление = Ложь)
	
	Если РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" Тогда 
		Элементы.СтраницыДоступностиПоСтруктурнымЕдиницам.ТекущаяСтраница = Элементы.ГруппаСтруктурнаяЕдиница;
	Иначе 
		Элементы.СтраницыДоступностиПоСтруктурнымЕдиницам.ТекущаяСтраница = Элементы.ГруппаСтруктурныеЕдиницыПрименения;
	КонецЕсли;	
	
	Если НачатьДобавление Тогда 
		Элементы.ГруппаПодсказка.Видимость = Ложь;
	Иначе 	
		Элементы.ГруппаПодсказка.Видимость = НЕ РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" И Объект.СтруктурныеЕдиницыПрименения.Количество() = 0;	
	КонецЕсли;	
	Элементы.СтруктурныеЕдиницыПрименения.Видимость = НЕ РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" И НЕ Элементы.ГруппаПодсказка.Видимость;
	Элементы.КнопкаДобавить.Видимость 				= НЕ РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" И НЕ Элементы.ГруппаПодсказка.Видимость;
	Элементы.УстановитьПоУмолчанию.Видимость 		= НЕ РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" И НЕ Элементы.ГруппаПодсказка.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементам списка статусов пациентов
//
// Параметры:
//  НачатьДобавление - 	 - 
//
Процедура УстановитьВидимостьЭлементамСпискаСтатусовПациентов(НачатьДобавление = Ложь)
	
	Если РежимОтображенияСпискаСтатусовПациента = "Поле" Тогда 
		Элементы.СтраницыДоступностиПоСтатусамПациентов.ТекущаяСтраница = Элементы.ГруппаСтатусПациента;
	Иначе 
		Элементы.СтраницыДоступностиПоСтатусамПациентов.ТекущаяСтраница = Элементы.ГруппаСтатусыПациентовПрименения;
	КонецЕсли;	
	
	Если НачатьДобавление Тогда 
		Элементы.ГруппаПодсказкаДляПанелиСтатусовПациентов.Видимость = Ложь;
	Иначе 	
		Элементы.ГруппаПодсказкаДляПанелиСтатусовПациентов.Видимость = НЕ РежимОтображенияСпискаСтатусовПациента = "Поле" И Объект.СтатусыПациентовПрименения.Количество() = 0;	
	КонецЕсли;	
	Элементы.СтатусыПациентовПрименения.Видимость 	= НЕ РежимОтображенияСпискаСтатусовПациента = "Поле" И НЕ Элементы.ГруппаПодсказкаДляПанелиСтатусовПациентов.Видимость;
	Элементы.КнопкаДобавитьСтатус.Видимость 		= НЕ РежимОтображенияСпискаСтатусовПациента = "Поле" И НЕ Элементы.ГруппаПодсказкаДляПанелиСтатусовПациентов.Видимость;
	Элементы.УстановитьПоУмолчаниюСтатусы.Видимость = Ложь; //НЕ РежимОтображенияСпискаСтатусовПациента = "Поле" И НЕ Элементы.ГруппаПодсказкаДляПанелиСтатусовПациентов.Видимость;
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать список структурных единиц
//
Процедура ИнициализироватьСписокСтруктурныхЕдиниц()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	               |	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ";
	
	МассивСтруктурныхЕдиниц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтруктурнаяЕдиница");
	
	СписокДоступныхСтруктурныхЕдиниц.ЗагрузитьЗначения(МассивСтруктурныхЕдиниц);
	МассивОтбираемыхСЕ = Новый Массив;
	
	Если РежимОтображенияСпискаСтруктурныхЕдиниц = "Поле" И Объект.СтруктурныеЕдиницыПрименения.Количество() = 0 Тогда
		НоваяСтрока = Объект.СтруктурныеЕдиницыПрименения.Добавить();
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДоступныхСтруктурныхЕдиниц Цикл
		Если Объект.СтруктурныеЕдиницыПрименения.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ЭлементСписка.Значение)).Количество() = 0 Тогда 
			МассивОтбираемыхСЕ.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
		Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(ЭлементСписка.Значение, , ?(Объект.СтруктурныеЕдиницыПрименения.Количество() > 0, Объект.СтруктурныеЕдиницыПрименения[0].СтруктурнаяЕдиница = ЭлементСписка.Значение, Ложь));
		//Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница.СписокВыбора.Добавить(ЭлементСписка.Значение);		
	КонецЦикла;
	
	Элементы.СтруктурнаяЕдиница.СписокВыбора.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), "В любой клинике", ?(Объект.СтруктурныеЕдиницыПрименения.Количество() > 0, Объект.СтруктурныеЕдиницыПрименения[0].СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка(), Ложь));
	
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСЕ)));
	
	Элементы.СтруктурныеЕдиницыПримененияСтруктурнаяЕдиница.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать список статусов пациентов
//
Процедура ИнициализироватьСписокСтатусовПациентов()
	
	ВидСделок__НовыеПациенты 		= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");
	ВидСделок__ПостоянныеПациенты 	= ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.ПостоянныеПациенты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтоПредопределенныеДанные_НовыеПациенты"		, ВидСделок__НовыеПациенты 		= Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоПредопределенныеДанные_ПостоянныеПациенты", ВидСделок__ПостоянныеПациенты = Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СтатусыКонтрагентов.Ссылка КАК СтатусПациента
	               |ИЗ
	               |	Перечисление.СтатусыКонтрагентов КАК СтатусыКонтрагентов
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ЭтоПредопределенныеДанные_НовыеПациенты
	               |				ТОГДА СтатусыКонтрагентов.Ссылка В (ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Потенциальный), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Первичный), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Отказ))
	               |			КОГДА &ЭтоПредопределенныеДанные_ПостоянныеПациенты
	               |				ТОГДА СтатусыКонтрагентов.Ссылка В (ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.НеВернувшийся), ЗНАЧЕНИЕ(Перечисление.СтатусыКонтрагентов.Постоянный))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтатусыКонтрагентов.Порядок";
	
	МассивСтатусовПациентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтатусПациента");
	
	СписокДоступныхСтатусовПациентов.ЗагрузитьЗначения(МассивСтатусовПациентов);
	МассивОтбираемыхСтатусов = Новый Массив;
	
	Если РежимОтображенияСпискаСтатусовПациента = "Поле" И Объект.СтатусыПациентовПрименения.Количество() = 0 Тогда
		НоваяСтрока = Объект.СтатусыПациентовПрименения.Добавить();
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДоступныхСтатусовПациентов Цикл
		Если Объект.СтатусыПациентовПрименения.НайтиСтроки(Новый Структура("СтатусПациента", ЭлементСписка.Значение)).Количество() = 0 Тогда 
			МассивОтбираемыхСтатусов.Добавить(ЭлементСписка.Значение);
		КонецЕсли;	
		Элементы.СтатусПациента.СписокВыбора.Добавить(ЭлементСписка.Значение, Перечисления.СтатусыКонтрагентов.ПолучитьПредставлениеСтатусаПациентаДляСпискаВыбора(ЭлементСписка.Значение), ?(Объект.СтатусыПациентовПрименения.Количество() > 0, Объект.СтатусыПациентовПрименения[0].СтатусПациента = ЭлементСписка.Значение, Ложь));
	КонецЦикла;
	
	Элементы.СтатусПациента.СписокВыбора.Добавить(Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), "Пациентов с любым статусом", ?(Объект.СтатусыПациентовПрименения.Количество() > 0, Объект.СтатусыПациентовПрименения[0].СтатусПациента = Перечисления.СтатусыКонтрагентов.ПустаяСсылка(), Ложь));
	
	Массив = Новый Массив;
	Массив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбираемыхСтатусов)));
	
	Элементы.СтатусыПациентовПримененияСтатусПациента.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаСервере
// Процедура, создает элементы списка точек доступа.
//
Процедура СоздатьЭлементыТаблицы()
	
	Индекс = 0;
	Для Каждого СтрокаТЧ из ЭтотОбъект.ЭтапыСделок Цикл
		СоздатьСтрокуЭлементовЭтапыСделок(Индекс);
		Индекс = Индекс + 1;
	КонецЦикла; 
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
// Процедура, создает строку элементов списка точек доступа.
//
Процедура СоздатьСтрокуЭлементовЭтапыСделок(Индекс)
	
	ГруппаНовыхЭл                       	= Элементы.Добавить("СтрокаТаблицы_" + Индекс, Тип("ГруппаФормы"), Элементы.ГруппаЭтапы);
	ГруппаНовыхЭл.Вид                  	 	= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНовыхЭл.Группировка           	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаНовыхЭл.Отображение           	= ОтображениеОбычнойГруппы.Нет;
	ГруппаНовыхЭл.ОтображатьЗаголовок   	= Ложь;
	ГруппаНовыхЭл.ГоризонтальныйИнтервал	= ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаНовыхЭл.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	// Создаем заглушку = номер этапа.
	ДекорацияФормы_Заглушка = Элементы.Добавить("Заглушка_" + Индекс, Тип("ДекорацияФормы"), ГруппаНовыхЭл);
	ДекорацияФормы_Заглушка.Вид 				   = ВидДекорацииФормы.Надпись;
	ДекорацияФормы_Заглушка.Заголовок 			   = Индекс + 1;
	ДекорацияФормы_Заглушка.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияФормы_Заглушка.МаксимальнаяШирина     = 4;
	ДекорацияФормы_Заглушка.Ширина                 = 4;
	//ДекорацияФормы_Заглушка.Шрифт				   = Новый Шрифт(11);
	ДекорацияФормы_Заглушка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ДекорацияФормы_Заглушка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
	КомандаКнопки = ЭтаФорма.Команды.Найти("КомандаВыбратьЦвет_" + Индекс);
	
	Если КомандаКнопки = Неопределено Тогда
		
		// Создаем команду кнопки.
		КомандаКнопки 	       = ЭтаФорма.Команды.Добавить("КомандаВыбратьЦвет_" + Индекс);
		КомандаКнопки.Действие = "ВыбратьЦвет";

	КонецЕсли;
		
	// Создаем кнопку выбора цвета.
	КнопкаФормы_Этап_Цвет = Элементы.Добавить("ИзменитьЦвет_" + Индекс, Тип("КнопкаФормы"), ГруппаНовыхЭл);
	КнопкаФормы_Этап_Цвет.Отображение 	    = ОтображениеКнопки.Картинка;	
	КнопкаФормы_Этап_Цвет.ИмяКоманды  	    = КомандаКнопки.Имя;
	КнопкаФормы_Этап_Цвет.ЦветФона 	  	    = ?(ЗначениеЗаполнено(ЭтапыСделок[Индекс].Цвет), ЗначениеИзСтрокиВнутр(ЭтапыСделок[Индекс].Цвет), Новый Цвет());
	КнопкаФормы_Этап_Цвет.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	
	// Всплывающая группа палитры цветов.
	ГруппаВсплывающая = Элементы.Добавить("ГруппаВсплывающая_" + Индекс, Тип("ГруппаФормы"), ГруппаНовыхЭл);
	ГруппаВсплывающая.Вид                   = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВсплывающая.Поведение			    = ПоведениеОбычнойГруппы.Всплывающая;
	ГруппаВсплывающая.Заголовок			    = " ";	
	ГруппаВсплывающая.Группировка           = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаВсплывающая.Отображение           = ОтображениеОбычнойГруппы.Нет;
	ГруппаВсплывающая.ШрифтЗаголовка	    = Новый Шрифт(,1);
	ГруппаВсплывающая.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
	// Создаем заглушку, для постоянного отображения всплывающей группы.
	ДекорацияФормы_Заглушка = Элементы.Добавить("ЗаглушкаПромежуток_" + Индекс, Тип("ДекорацияФормы"), ГруппаВсплывающая);
	ДекорацияФормы_Заглушка.Вид 			= ВидДекорацииФормы.Надпись;
	ДекорацияФормы_Заглушка.ЦветФона 		= Новый Цвет(255, 255, 255);
	
	// Создаем поле ввода наименования этапа.
	НовыйЭтап                    			= Элементы.Добавить("Наименование_" + Индекс, Тип("ПолеФормы"), ГруппаНовыхЭл);
	НовыйЭтап.Вид                			= ВидПоляФормы.ПолеВвода;
	НовыйЭтап.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;		
	НовыйЭтап.ПодсказкаВвода     			= "Наименование";		
	НовыйЭтап.ПутьКДанным        			= "ЭтапыСделок[" + Индекс +"].Наименование";		
	НовыйЭтап.УстановитьДействие("ПриИзменении", "ДобавитьНовыйЭтап");
	НовыйЭтап.МаксимальнаяШирина            = 42;
	НовыйЭтап.АвтоМаксимальнаяШирина        = Ложь;
	
	// Группа кнопок вверх/вниз.
	ГруппаВверхВниз                       	= Элементы.Добавить("ГруппаВверхВниз_" + Индекс, Тип("ГруппаФормы"), ГруппаНовыхЭл);
	ГруппаВверхВниз.Вид                  	= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВверхВниз.Группировка           	= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВверхВниз.Отображение           	= ОтображениеОбычнойГруппы.Нет;
	ГруппаВверхВниз.ГоризонтальныйИнтервал  = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаВверхВниз.ОтображатьЗаголовок		= Ложь;
	ГруппаВверхВниз.Доступность 			= НЕ ЗаблокироватьИзменениеЭтапов;
	
	// Создаем кнопку вверх.
	КнопкаПереместитьВверх                  = Элементы.Добавить("СтрокуТаблицыВверх_" + Индекс, Тип("КнопкаФормы"), ГруппаВверхВниз);
	КнопкаПереместитьВверх.Отображение     	= ОтображениеКнопки.Картинка;
	КнопкаПереместитьВверх.ОтображениеФигуры= ОтображениеФигурыКнопки.Нет;
	КнопкаПереместитьВверх.ИмяКоманды      	= "ПереместитьВверх";  
	КнопкаПереместитьВверх.Доступность 		= НЕ ЗаблокироватьИзменениеЭтапов;
	
	// Создаем кнопку вниз.
	КнопкаПереместитьВниз                 	= Элементы.Добавить("СтрокуТаблицыВниз_" + Индекс, Тип("КнопкаФормы"), ГруппаВверхВниз);
	КнопкаПереместитьВниз.Отображение     	= ОтображениеКнопки.Картинка;
	КнопкаПереместитьВниз.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	КнопкаПереместитьВниз.ИмяКоманды      	= "ПереместитьВниз";  
	КнопкаПереместитьВниз.Доступность 		= НЕ ЗаблокироватьИзменениеЭтапов;
	
	// Создаем кнопку удаления.
	КнопкаУдаления                  		= Элементы.Добавить("УдалитьСтрокуТаблицы_" + Индекс, Тип("КнопкаФормы"), ГруппаНовыхЭл);
	КнопкаУдаления.Отображение     	    	= ОтображениеКнопки.Картинка;
	КнопкаУдаления.ОтображениеФигуры 		= ОтображениеФигурыКнопки.Нет;
	КнопкаУдаления.ИмяКоманды      	    	= "УдалитьСтрокуТаблицы";    	
	КнопкаУдаления.Доступность 				= НЕ ЗаблокироватьИзменениеЭтапов;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость динамических элементов.
//
Процедура УстановитьВидимость()
	
	Индекс = 0;
	Для Каждого СтрокаТЧ из ЭтапыСделок Цикл		
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Наименование) И НЕ ЗначениеЗаполнено(СтрокаТЧ.Ссылка) Тогда
			
			Элементы["ИзменитьЦвет_" + Индекс].Доступность 		 = Ложь;
			Элементы["ИзменитьЦвет_" + Индекс].ЦветФона 		 = Новый Цвет(255,255,255);
			Элементы["ИзменитьЦвет_" + Индекс].ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			
			Элементы["УдалитьСтрокуТаблицы_" + Индекс].Видимость = Ложь;
			Элементы["СтрокуТаблицыВверх_" + Индекс].Видимость   = Ложь;			
			Элементы["СтрокуТаблицыВниз_" + Индекс].Видимость 	 = Ложь;
			
			Элементы["Заглушка_" + Индекс].Заголовок 	 		 = "";
			Элементы["Заглушка_" + Индекс].Ширина	 	 		 = 3;
			Элементы["Заглушка_" + Индекс].МаксимальнаяШирина	 = 3;

		Иначе	
			
			Элементы["ИзменитьЦвет_" + Индекс].Доступность 		 = Истина;
			Элементы["ИзменитьЦвет_" + Индекс].ОтображениеФигуры = ОтображениеФигурыКнопки.Авто;
			
			Элементы["ИзменитьЦвет_" + Индекс].Видимость 		 = Истина;
			Элементы["УдалитьСтрокуТаблицы_" + Индекс].Видимость = Истина;
			Элементы["СтрокуТаблицыВверх_" + Индекс].Видимость 	 = Истина;			
			Элементы["СтрокуТаблицыВниз_" + Индекс].Видимость 	 = Истина;
			
			Элементы["Заглушка_" + Индекс].Заголовок 	 		 = Индекс + 1;
			Элементы["Заглушка_" + Индекс].Ширина	 	 		 = 2;
			Элементы["Заглушка_" + Индекс].МаксимальнаяШирина	 = 2;

		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет элементы формы связанные со списком точек доступа.
//
Процедура УдалитьЭлементыТаблицы(ИндексСтроки)
	
	СтрокаДанных = ЭтапыСделок[ИндексСтроки];	
	Если Не СтрокаДанных = Неопределено Тогда 		
		
		Индекс = 0;
		Для Каждого СтрокаТЧ Из ЭтапыСделок Цикл
			Элементы.Удалить(Элементы["УдалитьСтрокуТаблицы_" + Индекс]);	
			Элементы.Удалить(Элементы["СтрокаТаблицы_" + Индекс]);
			Индекс = Индекс + 1;              
		КонецЦикла;	
		
		Если Не СтрокаДанных.Ссылка.Пустая() Тогда
			ОбъектСсылка = СтрокаДанных.Ссылка.ПолучитьОбъект();
			ОбъектСсылка.ПометкаУдаления = Истина;
			ОбъектСсылка.Записать();
		КонецЕсли;
		
		ЭтапыСделок.Удалить(СтрокаДанных);		
		СоздатьЭлементыТаблицы(); 
		
	КонецЕсли;                            
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить причину отказа на сервере
//
// Параметры:
//  ИндексСтроки - 	 - 
//
Процедура УдалитьПричинуОтказаНаСервере(ИндексСтроки)
	
	СтрокаДанных = Объект.ПричиныОтказов.Получить(ИндексСтроки);	
	ГруппаРазмещенияПричинОтказа = Элементы.Найти("ГруппаЭтапаИПричинОтказов");
	Если НЕ ГруппаРазмещенияПричинОтказа = Неопределено Тогда 
		//УдалитьЭлементыГруппы(ГруппаРазмещенияПричинОтказа);
		Объект.ПричиныОтказов.Удалить(СтрокаДанных);		
        ОтобразитьДопустимыеПричиныОтказа();
    КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Процедура - Удалить элементы группы
//
// Параметры:
//  Форма				 - 	 - 
//  РодительскаяГруппа	 - 	 - 
//
Процедура УдалитьЭлементыГруппы(РодительскаяГруппа)
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для Каждого ГруппаЭлементов Из Элементы[РодительскаяГруппа.Имя].ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаЭлементов);
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//  
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	КонецЕсли;
	 	
КонецФункции

&НаСервере
// Процедура, обновить динамические элементы.
//
Процедура ОбновитьДинамическиеЭлементы()
	
	ОчиститьДинамическиеЭлементы();
	СоздатьЭлементыТаблицы();

КонецПроцедуры

&НаСервере
// Процедура, очищает динамические элементы.
//
Процедура ОчиститьДинамическиеЭлементы()
	
	ПереместитьПалитруКРодителю();
	
	ЭлементыГруппы = Элементы.ГруппаЭтапы.ПодчиненныеЭлементы;
	КоличествоЭлементов = ЭлементыГруппы.Количество();
	
	Пока КоличествоЭлементов <> 0  Цикл
		
		Элементы.Удалить(ЭлементыГруппы[0]);
		КоличествоЭлементов = КоличествоЭлементов - 1;
			
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
// Процедура, добавить этап на сервере.
//
Процедура ДобавитьНовыйЭтапНаСервере()
	
	НоваяСтрока  = ЭтапыСделок.Добавить();	
	ИндексСтроки = ЭтапыСделок.Количество() - 1;
	
	СоздатьСтрокуЭлементовЭтапыСделок(ИндексСтроки);
	
	ЭтаФорма.ТекущийЭлемент = Элементы["Наименование_" + ИндексСтроки];
	
	УстановитьВидимость();

КонецПроцедуры

&НаСервере
// Процедура, изменить этап на сервере.
//
Процедура ИзменитьЦветЭтапаНаСервере(ИмяКоманды, Цвет)
	
	ИндексСтроки = ПолучитьИндексСтроки(Элементы.ВсплывающаяПалтира.Родитель.Имя);
	Этап 	  	 = ЭтаФорма.ЭтапыСделок[ИндексСтроки];
	Этап.Цвет 	 = ЗначениеВСтрокуВнутр(Цвет);
	Элементы["ИзменитьЦвет_" + ИндексСтроки].ЦветФона = Цвет;
	
	ПереместитьПалитруКРодителю();
	
	ИндексПоследнейСтроки   = ЭтапыСделок.Количество() - 1;
	ЭтаФорма.ТекущийЭлемент = Элементы["Наименование_" + ИндексПоследнейСтроки]; 
	
КонецПроцедуры

&НаКлиенте
// Функция - Добавить новую причину отказа
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьНовуюПричинуОтказа()
	
	НоваяСтрока  = Объект.ПричиныОтказов.Добавить();	
	ИндексСтроки = Объект.ПричиныОтказов.Индекс(НоваяСтрока);
	
	Возврат ИндексСтроки;
	
КонецФункции












#КонецОбласти
